Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: For a comprehensive date and time representation look at the L<DateTime> module.
es_es: Para una completa y actualizada representación del tiempo mire el módulo L<DateTime>.

source: If you've downloaded the binary distribution, it needs to be installed below /usr/local.
es_es: Si ha descargado la distribución binaria, necesita ser instalada en /usr/local.

source: Currently NAME is restricted to simple identifiers only.
es_es: Actualmente NOMBRE está limitado solamente a identificadores sencillos.

source: There are improved hints for next-3.0, vmesa, IX, Darwin, Solaris, Linux, DEC/OSF, HP-UX and MPE/iX
es_es: Hay mejoras para next-3.0, vmesa, IX, Darwin, Solaris, Linux, DEC/OSF, HP-UX y MPE/iX

source: perlmacosx Perl notes for Mac OS X
es_es: perlmacosx Notas para Mac OS X

source: $atime,$mtime,$ctime,$blksize,$blocks) = stat($filename);
es_es: $atime,$mtime,$ctime,$blksize,$blocks) = stat($archivo);

source: We are grateful to the Debian project for their input in this area.
es_es: Estamos muy agradecidos con el proyecto Debian por sus aportaciones en este ámbito.

source: It's equivalent to C<||> except for the very low precedence.
es_es: Es equivalente a "||" excepto por tener una precedencia muy baja.

source: This mode remains in effect until the next mode change, or until the end of the C<()> group it (directly) applies to.
es_es: Este modo permanece activo hasta el cambio del modo siguiente, o hasta el final del grupo C<()> en que se aplicó directamente.

source: In related fixes, it was possible for badly written code that did not follow the documentation of C<Sys::Syslog> to have formatting vulnerabilities.
es_es: En arreglos relacionados, era posible, para código mal escrito que no siguiera la documentación de C<Sys::Syslog>, tener vulnerabilidades en el formateo.

source: If there are no elements in the array, returns the undefined value.
es_es: Si no hay elementos en el array, devuelve el valor undef.

source: If you're dealing with just matrices, it's often easiest to use simple assignment:
es_es: Si está tratando con matrices justo, a menudo es más fácil usar una asignación simple:

source: It is intended as a "bootstrap" guide for those who are new to the language, and provides just enough information for you to be able to read other peoples' Perl and understand roughly what it's doing, or write your own simple scripts.
es_es: Es una guía de iniciación para los nuevos usuarios del lenguaje que proporciona la información necesaria para poder leer el código Perl de otras personas y comprender a grandes rasgos su funcionamiento, o para escribir scripts sencillos.

source: C<Devel::PPPort> upgraded to version 3.06_01
es_es: C<Devel::PPPort> actualizado a la versión 3.06_01

source: Otherwise, the right side is a method name or a simple scalar variable containing either the method name or a subroutine reference, and the left side must be either an object (a blessed reference) or a class name (that is, a package name).
es_es: De lo contrario, el lado derecho es un nombre de método o una variable escalar simple conteniendo ya sea el nombre del método o una referencia a una subrutina, y el lado izquierdo debe ser un objeto (una referencia bendecida) o un nombre de clase (es decir, un nombre de paquete).

source: Beginning with v5.6.0, Perl will attempt to flush all files opened for output before any operation that may do a fork, but this may not be supported on some platforms (see L<perlport>).
es_es: Empezando con v5.6.0, Perl intentará vaciar todos los archivos abiertos para la salida antes de cualquier operación que pueda hacer un fork, pero esto quizás no esté soportado en algunas plataformas (vea L<perlport>).

# die unless $@ eq "alarm "; # propagate unexpected errors
source: die unless $@ eq "alarm\n"; # propagate unexpected errors
es_es: die unless $@ eq "alarma\n"; # propagar errores inesperados

source: Of course, you don't need the temporary array to have a name at all:
es_es: Por supuesto, no necesita el array temporal para nada:

source: Unless you've changed this (such as building Perl with C<Configure -Uuseperlio>), you can open filehandles directly to Perl scalars via:
es_es: A menos que haya cambiado esto (como compilar Perl con C<Configure -Uuseperlio>), puede abrir identificadores de archivo directamente a escalares Perl de esta forma:

source: C<x> and C<X> accept the C<!> modifier to act as alignment commands: they jump forward or back to the closest position aligned at a multiple of C<count> characters.
es_es: C<x> y C<X> aceptan el modificar C<!> para actuar como comando de alineamiento: saltan hacia adelante o atrás a la posición más cercana alineada a un múltiplo de C<contador> caracteres.

source: Modules should be packaged using one of the standard packaging tools.
es_es: Los módulos deben estar empaquetados con una de las herramientas de empaquetado estándar.

source: The caret tells Perl that this cluster doesn't inherit the flags of any surrounding pattern, but uses the system defaults (C<d-imsx>), modified by any flags specified.
es_es: El circunflejo le dice a Perl que esta agrupación no hereda las banderas de ningún patrón vecino, pero usa los valores por defecto del sistema (C<d-imsx>), modificado por cualquier otra bandera especificada.

source: l Use the locale
es_es: l Usa la definición regional local (I<locale>)

source: That's because you're assigning to an @array, so you need parentheses.
es_es: Esto es así porque está asignando a un @array, por lo que necesita usar paréntesis.

source: You can do various useful things to lists:
es_es: Puede hacer varias cosas útiles con las listas:

source: S<[ B<-i>[I<extension>] ]>
es_es: S<[ B<-i>[I<extensión>] ]>

source: See also L</continue> for an illustration of how C<last>, C<next>, and C<redo> work.
es_es: Ver también L</continue> para una ilustración de cómo funcionan C<last>, C<next> y C<redo>.

source: (This is important only if C<S> has capturing parentheses, and backreferences are used somewhere else in the whole regular expression.)
es_es: (Esto es importante sólo si C<S> tiene paréntesis de captura, y las contrareferencias son utilizadas en otra parte de la expresión regular.)

source: for ($variable) { # trim whitespace in $variable, cheap
es_es: for ($variable) { # recorta el espacio en blanco en $variable, de forma más simple

# if ( /foo(.*?)bar/ ) { print "got <$1> " }
source: if ( /foo(.*?)bar/ ) { print "got <$1>\n" }
es_es: if ( /mesa(.*?)come/ ) { print "obtiene <$1>\n" }

source: =head2 Requirements
es_es: =head2 Requisitos

source: But alternative hashing schemes (like MD5), higher level security schemes (like C2), and implementations on non-Unix platforms may produce different strings.
es_es: Pero esquemas alternativos de cálculo de hash (como MD5), esquemas de seguridad de alto nivel (como C2) e implementaciones en plataformas no UNIX pueden producir cadenas diferentes.

source: Some documentation improvements
es_es: Algunas mejoras en la documentación

source: L<http://archive.develooper.com/perl-mvs@perl.org/>
es_es: http://archive.develooper.com/perl-mvs@perl.org/

source: {n,}+ Match at least n times and give nothing back
es_es: {n,}+ Coincide al menos n veces y no devuelve nada

source: Perl Mongers uses the pm.org domain for services related to Perl user groups, including the hosting of mailing lists and web sites.
es_es: Perl Mongers usa el dominio pm.org para ofrecer servicios relacionados para grupos de usuarios de Perl, como el alojamiento de listas de correo y sitios web.

source: $oct_perm_str = sprintf "%o", $perms;
es_es: $oct_perm_str = sprintf "%o", $permisos;

source: $rounded = sprintf("%.3f", $number);
es_es: $redondeo = sprintf("%.3f", $numero);

source: If the exception is outside of all enclosing C<eval>s, then the uncaught exception prints LIST to C<STDERR> and exits with a non-zero value.
es_es: Si la excepción está fuera de un C<eval>, entonces la excepción no capturada imprime LISTA al C<STDERR> y sale con un valor no nulo.

source: It's cleaner, safer, and faster.
es_es: Es más limpio, seguro y rápido.

source: perl5004delta Perl changes in version 5.004
es_es: perl5004delta Cambios en la versión 5.004

source: See the B<-i> switch in L<perlrun> for a better approach.
es_es: Ver la opción B<-i> en L<perlrun> para una mejor aproximación.

source: When you use the C<use warnings> pragma or Perl's B<-w> command-line option, you may see warnings about useless uses of constants or functions in "void context".
es_es: Cuando se utiliza el pragma C<use warnings> o la opción de Perl en la línea de órdenes B<-w>, pueden mostrarse avisos sobre el uso inútil de constantes o funciones en contexto vacío ("I<void>").

source: This strategy is so successful that Perl programmers often do not suspect the ambivalence of what they write.
es_es: Esta estrategia es tan exitosa que los programadores de Perl a menudo no sospechan de la ambivalencia de lo que escriben.

source: Tutorial documents included in current or upcoming Perl releases include L<perltoot> for objects or L<perlboot> for a beginner's approach to objects, L<perlopentut> for file opening semantics, L<perlreftut> for managing references, L<perlretut> for regular expressions, L<perlthrtut> for threads, L<perldebtut> for debugging, and L<perlxstut> for linking C and Perl together.
es_es: Entre los tutoriales incluidos en la versión actual de Perl (o en futuras versiones) se cuentan L<perltoot> (objetos), L<perlboot> (introducción a la programación orientada a objetos para principiantes), L<perlopentut> (semántica de apertura de archivos), L<perlreftut> (administración de referencias), L<perlretut> (expresiones regulares), L<perlthrtut> (hilos de ejecución), L<perldebtut> (depuración) y L<perlxstut> (comunicación de código C con código Perl).

source: If ARRAY is omitted, pops the C<@ARGV> array in the main program, but the C<@_> array in subroutines, just like C<shift>.
es_es: Si ARRAY se omite, se extrae desde el array C<@ARGV> en el programa principal, y del array C<@_> en subrutinas, igual que C<shift>.

source: That is, when a LIST is evaluated, each element of the list is evaluated in list context, and the resulting list value is interpolated into LIST just as if each individual element were a member of LIST.
es_es: Es decir, cuando una LISTA se evalúa, cada elemento de la lista se evalúa en contexto lista, y el valor de la lista resultante se interpola en la LISTA como si cada elemento individual fuera un miembro de LISTA.

source: The type prefix of a typeglob is a C<*>, because it represents all types.
es_es: El prefijo de un tipo de typeglob es una C<*>, porque representa todos los tipos.

source: =head1 Storing numbers
es_es: =head1 Cómo se almacenan los números

source: Attempts to connect to a remote socket, just like connect(2).
es_es: Intenta conectarse a un socket remoto, al igual que connect(2).

source: If a <FILEHANDLE> is used in a context that is looking for a list, a list comprising all input lines is returned, one line per list element.
es_es: Si un <IDENTIFICADOR_ARCHIVO> es utilizado en un contexto en el que está esperando una lista, es devuelta una lista que contiene todas las líneas de entrada, una línea por cada elemento de la lista.

source: To get multiple values from an array:
es_es: Para obtener varios elementos de un array:

source: Again, return 1 for each valid line, and 0 after all lines have been returned.
es_es: De nuevo, devuelve 1 para cada línea válida y 0 después de que todas las líneas han sido devueltas.

source: You can actually chop anything that's an lvalue, including an assignment.
es_es: Puede recortar cualquier cosa que sea un lvalue (valor a la izquierda), incluyendo una asignación.

source: my @greek_small = ("\N{alpha}" ..
es_es: my @griegas_minusculas = ("\N{alpha}" ..

source: =head2 New parser
es_es: =head2 Nuevo analizador

source: Since you don't have a C compiler, you're doomed and your vendor should be sacrificed to the Sun gods.
es_es: Como no tiene un compilador de C, no puede hacerlo; podría descargar su ira contra su proveedor.

source: To forbid ASCII/non-ASCII matches (like "k" with C<\N{KELVIN SIGN}>), specify the "a" twice, for example C</aai> or C</aia>
es_es: Para prohibir coincidencias ASCII/no-ASCII (como "k" con C<\N{KELVIN SIGN}>), especifique la "a" dos veces, por ejemplo C</aai> o C</aia>

source: allow installing extra modules or bundles when building Perl
es_es: permitir la instalación de módulos extra o empaquetados cuando se compila Perl

source: (To convert strings that might start with either C<0>, C<0x>, or C<0b>, see L</oct>.) If EXPR is omitted, uses C<$_>.
es_es: (Para convertir strings que pueden comenzar con C<0>, C<0x> o C<0b>, ver L</oct>.) Si se omite EXPR, usa C<$_>.

source: It used to provide a mechanism to emulate setuid permission bits on systems that don't support it properly.
es_es: Se utiliza para proporcionar un mecanismo para emular a los bits de permiso setuid en sistemas que no lo soportan correctamente.

source: These are the semantics that lockf(3) implements.
es_es: Estas son las semánticas que lockf(3) implementa.

source: Some operators return the first value in the list.
es_es: Algunos operadores devuelven el primer valor de la lista.

source: unless defined($value = readlink $sym);
es_es: unless defined($valor = readlink $sym);

source: when (/y/) { say '$foo contains a y' }
es_es: when (/y/) { say '$foo contiene una y' }

source: README.macos - Perl under Mac OS (Classic)
es_es: README.macos - Perl bajo Mac OS (Classic)

source: See L<perlunicode/The "Unicode Bug">.
es_es: Vea L<perlunicode/El "Bug Unicode">.

source: =head2 References
es_es: =head2 Referencias

source: This aspect of C<unshift> is considered highly experimental.
es_es: Este aspecto de C<unshift> es considerado altamente experimental.

source: FILEHANDLE may be an expression whose value gives the real filehandle.
es_es: IDENTIFICADOR_ARCHIVO puede ser una expresión cuyo valor da el identificador de archivo real.

source: =item Backticks
es_es: =item Comillas invertidas

source: =head2 Source filters in @INC
es_es: =head2 Filtros de código fuente en @INC

source: When assigning to a list, if LIMIT is omitted, or zero, Perl supplies a LIMIT one larger than the number of variables in the list, to avoid unnecessary work.
es_es: Al asignar a una lista, si LÍMITE es omitido, o cero, Perl proporciona un LÍMITE uno mayor que el número de variables en la lista, para evitar trabajo innecesario.

source: Restore backwards compatibility with earlier versions of perl
es_es: Restaura la compatibilidad con versiones anteriores de perl

source: =item getgrnam NAME
es_es: =item getgrnam NOMBRE

source: Thus ((),(),()) is equivalent to ().
es_es: Así que ((),(),()) es equivalente a ().

source: =item shmwrite ID,STRING,POS,SIZE
es_es: =item shmwrite ID,CADENA,POSICIÓN,TAMAÑO

source: because the outcome may be determined by voting based on heuristic estimators, the result is not strictly predictable.
es_es: Debido a que el resultado puede ser determinado por votación basada en estimadores heurísticos, el resultado no es estrictamente predecible.

source: =head2 Updated Modules And Pragmata
es_es: =head2 Módulos y Pragmata actualizados

source: One should conscientiously choose between the I<magic> and I<three-argument> form of open():
es_es: Uno debe elegir escrupulosamente entre la I<magia> y la forma de I<tres argumentos> de open():

source: For reasons of security, this construct is forbidden if the regular expression involves run-time interpolation of variables, unless the perilous C<use re 'eval'> pragma has been used (see L<re>), or the variables contain results of the C<qr//> operator (see L<perlop/"qrE<sol>STRINGE<sol>msixpodual">).
es_es: Por razones de seguridad, esta construcción está prohibida si la expresión regular incluye interpolación de variables en tiempo de ejecución, a menos que el peligroso pragma C<use re 'eval'> esté en uso (vea L<re>), o las variables contengan resultados del operador C<qr//> (vea L<perlop/"qr/CADENAE<sol>msixpodual">).

source: You may also use C<defined(&func)> to check whether subroutine C<&func> has ever been defined.
es_es: Puede usar también C<defined(&func)> para comprobar si la subrutina C<&func> ha sido definida.

source: It can test a random subset each time, and should there be a failure, log the seed used for that run so that it can later be used to reproduce the same results.
es_es: Se puede probar un subconjunto aleatorio cada vez, y si ocurre un fallo, registre las semillas utilizadas para las que se ha ejecutado a fin de que más adelante se puedan utilizar para reproducir los mismos resultados.

source: Capture groups are numbered from left to right, but inside this construct the numbering is restarted for each branch.
es_es: Los grupos de captura son numerados de izquierda a derecha, pero dentro de esta construcción la numeración es reiniciada en cada rama.

source: That's because while we have a nice synonym for single elements via the pointer arrow for dereferencing, no such convenience exists for slices.
es_es: Eso es porque mientras que nosotros tenemos un sinónimo sencillo para los elementos individuales a través de la flecha puntero de desreferencia, no existe tal conveniencia para las porciones.

source: The variable has been deprecated for a long time, and a deprecation warning C<Use of $* is deprecated> is given, now the variable will just finally be removed.
es_es: La variable ha dejado de utilizarse desde hace bastante tiempo, y ahora se muestra la advertencia de desaprobación C<Use of $* is deprecated>; ahora la variable será finalmente eliminada.

source: C<state> variables are enabled only when the C<use feature "state"> pragma is in effect.
es_es: C<state> variables sólo se activan cuando el pragma C<use feature "state"> está en vigor.

source: $dec_perms = (stat("filename"))[2] & 07777;
es_es: $dec_perms = (stat("archivo"))[2] & 07777;

source: (print $foo), exit; # This is what you want.
es_es: (print $foo), exit; # Esto es lo que quiere hacer.

source: C<ByteLoader> upgraded to version 0.06
es_es: C<ByteLoader> actualizado a la versión 0.06

source: Only those places that contain this "rarest" character are examined.)
es_es: Sólo estos lugares que contienen este "carácter" más raro son examinados).

source: Perl can use sophisticated pattern matching techniques to scan large amounts of data quickly.
es_es: Perl puede utilizar sofisticadas técnicas de detección de patrones para analizar rápidamente grandes cantidades de datos.

source: See L</ucfirst> for that.
es_es: Ver L</ucfirst> para eso.

source: $text = ucfirst $text;
es_es: $texto = ucfirst $texto;

source: This directory contains pure-Perl modules which are only released as part of the core.
es_es: Este directorio contiene módulos programados en puro Perl que solo se publican como parte del núcleo.

source: It's "C123", which suffices.
es_es: Se trata de "C123", suficiente.

source: For the new life of this switch, see L<"UTF-8 no longer default under UTF-8 locales">, and L<perlrun/-C>.
es_es: Para la nueva vida de esta opción, vea L<"UTF-8 ya no está por defecto bajo la configuración regional de UTF-8"> y L<perlrun/-C>.

source: an empty list as soon as an explicit C<break> is encountered.
es_es: una lista vacía tan pronto como se encuentre un C<break> explícito.

source: If in doubt, spell out the character sets in full.
es_es: En caso de duda, explicite los conjuntos de caracteres completamente.

source: =item split /PATTERN/
es_es: =item split /PATRÓN/

source: C<defined(...)>, C<exists(...)>, or C<eof(...)>
es_es: C<defined(...)>, C<exists(...)>, o C<eof(...)>

source: Returns the process id of the parent process.
es_es: Devuelve el identificador de proceso del proceso padre.

source: Those features are described below.
es_es: Estas características se describen a continuación.

source: ISBN 978-0-596-00503-0 [1st edition January 2004]
es_es: ISBN 978-0-596-00503-0 [1ª edición - Enero de 2004]

source: =item String comparison
es_es: =item Comparación de cadenas

source: =item sort BLOCK LIST
es_es: =item sort BLOQUE LISTA

source: Match at least n but not more than m times, not greedily
es_es: Coincide al menos n pero no más de m veces, sin avaricia

source: You cant usually use either read-write mode for updating textfiles, since they have variable-length records.
es_es: Por lo general, no puede utilizar el modo de lectura-escritura para la actualización de archivos de texto, ya que tienen registros de longitud variable.

source: Ordinarily you must assign the returned value to a variable, but there is one situation where an automatic assignment happens.
es_es: Normalmente debe asignar el valor devuelto a una variable, pero hay una situación en la que sucede una asignación automática.

source: \G Match only at pos() (e.g. at the end-of-match position
es_es: \G Coincide solo en pos() (p. ej. en la posición de la última coincidencia

source: =head2 Which magazines have Perl content?
es_es: =head2 ¿En qué revistas puedo encontrar artículos sobre Perl?

source: Only C<m??> patterns local to the current package are reset.
es_es: Sólo son reinicializados los patrones locales C<m??> del paquete actual.

source: =head2 Quote-Like Operators X<operator, quote-like>
es_es: =head2 Operadores de entrecomillado X<operator, quote-like> X<operador, entrecomillado>

source: C<syslog()> now uses local timestamp.
es_es: C<syslog()> ahora usa fecha y hora locales.

source: =item `STRING`
es_es: =item `CADENA`

source: Extracts a substring out of EXPR and returns it.
es_es: Extrae una subcadena de EXPR y la devuelve.

source: pthreads patches information.
es_es: de parches en pthreads.

source: The actual limit can be seen in the error message generated by code such as this:
es_es: El límite real se puede ver en el mensaje de error generado por un código como este:

source: next unless -f $_; # ignore specials
es_es: next unless -f $_; # ignora especiales

source: You'll notice that perl is not itself written in Perl.
es_es: Notará que perl no está programado en Perl.

source: perlfaq1 General Questions About Perl
es_es: perlfaq1 Preguntas generales sobre Perl

source: my ($logmessage, $priority) = @_; # common
es_es: my ($mensaje_registro, $prioridad) = @_; # común

source: =head1 Performance Enhancements
es_es: =head1 Mejoras en el rendimiento

source: See L<autodie/"BUGS"> for more details.
es_es: Vea L<autodie/"ERRORES"> para más detalles.

source: will match, and C<$1> will be C<AB> and C<$2> will be C<B>, C<$3> will not be set.
es_es: coincidirá, y C<$1> será C<AB> y C<$2> será C<B>; C<$3> no será ajustado.

source: # inefficiently sort by descending numeric compare using
es_es: # ordenación ineficiente por comparación numérica descendente usando

source: Confused?
es_es: ¿Confundido?

source: You may (and usually should) use the three-argument form of open to specify I/O layers (sometimes referred to as "disciplines") to apply to the handle that affect how the input and output are processed (see L<open> and L<PerlIO> for more details).
es_es: Puede (y normalmente debería) usar la forma de tres argumentos de open para especificar capas E/S (algunas veces referidas como "disciplinas") para aplicarlas al identificador, afectando al modo en que la entrada y salida son procesadas (vea L<open> y L<PerlIO> para más detalles).

source: perl5140delta Perl changes in version 5.14.0
es_es: perl5140delta Cambios en la versión 5.14.0

source: =head2 A note on freshness
es_es: =head2 ¿Está la lista al día?
